Revit 2024 API
PostPattern Members
The PostPattern type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PostPattern
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CornerPost
 Accesses the object containing properties related to the corner post.
CornerPostAngle
 The angle between neighboring railing segments which conditions inserting post along a railing path.
CornerPostCondition
 The condition which controls the insertion of corner posts.
EndPost
 Accesses the object containing properties related to the end post.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StartPost
 Accesses the object containing properties related to the start post.
See Also
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace